For this exercise we will work with baby names. The data is present in folder `names` in data folder in parent directory.

# Function definition
Write a function parse_dataset(year) that helps you work with the data.

The function should:

- accept a single year as input value
- construct a valid file path
- read in the corresponding names dataset
- define the correct column index for the data set
- output the dataset as a pandas dataframe
- Example: Calling the function with parse_dataset(year=1880) should return:

birth table

Tips:

- First develop the code in a cell of a Jupyter notebook
- Start by defining a year variable year=1880
- Test the code on a few text lines only
- If everything works wrap the code into a function

In [1]:
import pandas as pd 
  # check the Data Frame

In [2]:
df= pd.read_csv('../../data/names/yob1880.txt')
df.head(2)

   Mary  F  7065
0  Anna  F  2604
1  Emma  F  2003

In [3]:
# Open the file when creating the variable year
year=1880

df_year= pd.read_csv(f'../../data/names/yob{year}.txt')

df_year.head(2)

   Mary  F  7065
0  Anna  F  2604
1  Emma  F  2003

In [4]:
#Create a path for using later in the function
path = f'../../data/names/yob{year}.txt'

# read again the file with the variables
df_year=pd.read_csv(path, names=['name','gender', 'frequency']) # Create the columns names
df_year.head(2)

   name gender  frequency
0  Mary      F       7065
1  Anna      F       2604

## create function

In [5]:
def parse_dataset(year):
    path= f'../../data/names/yob{year}.txt'
    df_year=pd.read_csv(path, names=['name','gender', 'frequency'])
    return df_year

# Function Calling
Using your parse_dataset() function write a program that calculates the total number of babys for the year 2020 and prints the number to the screen. Make sure to select the correct column to sum.
Do the same for 1950 and compare the results

In [6]:
parse_dataset(1880)

           name gender  frequency
0          Mary      F       7065
1          Anna      F       2604
2          Emma      F       2003
3     Elizabeth      F       1939
4        Minnie      F       1746
...         ...    ...        ...
1995     Woodie      M          5
1996     Worthy      M          5
1997     Wright      M          5
1998       York      M          5
1999  Zachariah      M          5

[2000 rows x 3 columns]

### Function total_names

In [7]:
def total_names (year):
    path= f'../../data/names/yob{year}.txt'
    df_year=pd.read_csv(path, names=['name','gender', 'frequency'])
    names_sum= df_year['frequency'].sum()
    return names_sum

In [8]:
parse_dataset(2020)
print(f'The total names in 2020 is', total_names(2020))

The total names in 2020 is 3333981

In [9]:
parse_dataset(1950)
print(f'The total names in 1950 is', total_names(1950))

The total names in 1950 is 3503404